Revit 2027 API
BuiltInFailures.RebarSystemFailures.ThinHostWallError Property
 Rebar Cover Interior and Exterior are too large for host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ThinHostWallError { get; }
Public Shared ReadOnly Property ThinHostWallError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ThinHostWallError {
	FailureDefinitionId^ get ();
}
static member ThinHostWallError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace